Conf.Simple/src/InformationRegisters/SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными/SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными</name>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КраткоеПредставлениеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПодробноеПредставлениеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Результаты.Сообщения
			|ИЗ
			|	РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными КАК Результаты
			|ГДЕ
			|	Результаты.ID = &ID";
		
		Запрос.УстановитьПараметр("ID", Запись.ID);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
			Сообщения = СтрСоединить(ОписаниеТипаМассив.ПривестиЗначение(Выборка.Сообщения.Получить()), Символы.ПС);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
